app/Controllers/Admin.php

    public function deleteCourse($courseId)
    {
        $access = $this->checkAccess();
        if ($access !== true) return $access;

        $courseModel = new \App\Models\CourseModel();
        $course = $courseModel->find($courseId);

        if (!$course) {
            return redirect()->to(site_url('admin/courses'))->with('error', 'Course not found');
        }

        $courseModel->delete($courseId);
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = '13'
DELETE FROM `courses`
WHERE `id` IN ('13')