app/Controllers/Auth.php

    private function getAdminData()
    {
        try {
        $userModel = new \App\Models\UserModel();

            $courseModel = new \App\Models\CourseModel();

        return [
            'total_users' => $userModel->countAll(),
                'total_courses' => $courseModel->countAll(),
            'admin_count' => $userModel->where('role', 'admin')->countAllResults(),
            'teacher_count' => $userModel->where('role', 'teacher')->countAllResults(),
            'student_count' => $userModel->where('role', 'student')->countAllResults(),
---
SELECT COUNT(*) AS `numrows` FROM `courses`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'admin'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'teacher'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'