app/Controllers/Notifications.php

    public function mark_as_read($id)
    {
        // Security: Check if user is logged in
        if (!session()->get('isLoggedIn')) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Unauthorized access. Please log in first.'
            ])->setStatusCode(401);
        }

        // Get user ID from session
        $userId = session()->get('user_id');
        if (!$userId) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Invalid session. Please log in again.'
            ])->setStatusCode(401);
        }

        // Validate notification ID
        if (!is_numeric($id) || $id <= 0) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Invalid notification ID.'
            ])->setStatusCode(400);
        }

        // Verify the notification belongs to the current user (security check)
        $notification = $this->notificationModel->find($id);
---
SELECT *
FROM `notifications`
WHERE `notifications`.`id` = '3'