app/Models/CourseModel.php

    public function getCoursesWithInstructor()
    {
        return $this->select('courses.*, users.name as instructor_name')
                    ->join('users', 'users.id = courses.instructor_id', 'left')
                    ->findAll();
---
SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`

    public function getCoursesByInstructor($instructorId)
    {
        return $this->where('instructor_id', $instructorId)
                    ->findAll();
---
SELECT *
FROM `courses`
WHERE `instructor_id` = '4'