app/Models/EnrollmentModel.php

SELECT `enrollments`.*, `enrollments`.`course_id`, `enrollments`.`enrollment_date` as `enrolled_at`, `courses`.`course_name`, `courses`.`description`, `courses`.`course_code`, `courses`.`id`, `users`.`name` as `instructor_name`
FROM `enrollments`
LEFT JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
WHERE `enrollments`.`user_id` = '4'
---
    public function getUserEnrollments($user_id)
    {
        return $this->select('enrollments.*, enrollments.course_id, enrollments.enrollment_date as enrolled_at, courses.course_name, courses.description, courses.course_code, courses.id, users.name as instructor_name')
                    ->join('courses', 'courses.id = enrollments.course_id', 'left')
                    ->join('users', 'users.id = courses.instructor_id', 'left')
                    ->where('enrollments.user_id', $user_id)
                    ->findAll();

SELECT *
FROM `enrollments`
WHERE `user_id` = '4'
AND `course_id` = '5'
 LIMIT 1
---
    public function isAlreadyEnrolled($user_id, $course_id)
    {
        return $this->where('user_id', $user_id)
                    ->where('course_id', $course_id)
                    ->first() !== null;